//  Використовуючи if...else напиши код, який буде запитувати у користувача "Яка офіційна назва JavaScript?".
//    Якщо користувач вводить "ECMAScript", то показати за допомогою alert("Вірно!")
//    У інших випадках показати "Не знаєте? ECMAScript!"

//const guestion = promt("Яка офіційна назва JavaScript?".);
//console.log(guestion);

//if (guestion.toLowerCase() === "ECMAScript.toLowerCase()") {
   // alert("Вірно!");
//} else {
    //alert "Не знаєте? ECMAScript!";
//}




//  Напишіть програму, яка отримає від користувача число(кількість хвилин)
// і виведе у консоль рядок у форматі годин та хвилин
// 70 === 01: 10

//const globalMinutes = 90





//  Напишіть цикл, який виводить у консоль числа від max до min у порядку зменшення.
// У консоль виведіть усі парні числа від max  до min

//const max = 50
//const min = 23







// За допомогою цикла for додайте всі парні числа від min до max

//const max = 50
//const min = 0
//let total = 0;
     
//for (let i = min; i <= max; i += 1){
    //if (i % 2 !== 1) {
        //total += i; 
    //}
//}
//console.log(total);




// При завантаженні сторінки користувачу пропонується у prompt ввести число.
//     Те, що вводить користувач, додається до значення змінної total.
// Операція вводу числа триває до тих пір, поки користувач не натисне кнопку Cancel в prompt.
// Після того, як користувач припинив вводити числа і натиснув на кнопку Cancel,
//     показувати alert з рядком "Загальна сума введених чисел дорівнює [число]."
// Робити перевірку, що користувач ввів саме число, а не довільні символи, не потрібно.




//Напиши код, який буде запитувати логін за допомогою prompt та логувати результат у консоль браузера.
// Якщо користувач вводить "Адмін", то prompt запитує пароль.Якщо нічого не введено або натиснута клавіша Esc,
//     вивести рядок "Відмінено"
//     У іншому випадку вивести рядок "Я вас не знаю!"
// Пароль перевіряти так:
// якщо введено пароль "Я головний", то вивести "Вітаю!",
//     у іншому випадку виводити рядок "Невірний пароль!".


//const userName = prompt("Ввести логін");
//const login = "Адмін";
//const password = "Я головний";
//if (userName === login) { 
    //const userPassword = prompt("Введіть пароль");
    //if (userPassword === password) {
       // alert("Вітаю!")
    //} else { alert("Невірний пароль!") }
//} else if (!userName) {
    //alert("Відмінено");
//}else{ alert("Я вас не знаю!")}

    
    
    
    
    
    
//  Напиши цикл, який пропонує ввести число більше 100 через prompt.
// Якщо користувач ввів інше число - попросити ввести ще раз і так далі.
// Цикл повинен запитувати число, поки користувач не введе число більше 100,
//   або не натисне кнопку "Відміна"






//Дано рядок, який складається із символів.Наприклад, 'abcde'.
//     Перевірте, що першим символом цього рядка є літера 'a'.
//  Якщо це так - вивести "так", у іншому випадку вивести "ні"



// У змінній  min лежить число від 0 до 59.
// Потрібно визначити, в яку чтверть години потрапить це число(в першу, другу, третю або четверту)

//var min = 10;
//if (min >= 0 && min <= 14) {
//alert ( 'В першу чверть.');
//}
//if (min >= 15 && min <= 30) {
//alert ( 'У другу чверть.');
//}
//if (min >= 31 && min <= 45) {
//alert ( 'В третю чверть.');
//}
//if (min >= 46 && min <= 59) {
//alert ( 'В четверту чверть.');
//}



// todo Напиши скрипт, який для об'єкта user послідовно:
//   - додасть поле mod зі значенням 'happy'
//   - замінить hobby на 'skydiving'
//   - замінить значення premium на false
//   - виводить вміст об'єкта user у форматі ключ:значення,
// використовуючи Object.keys() и for...of

//const user = {
  //name: 'John',
  //age: 20,
  //hobby: 'tenis',
  //premium: true,
//}





// todo У нас є об'єкт, у якому зберігаються заробітні плати команди.
// Напишіть код для отримання суми усіх зарплат і збережіть його результат у змінній sum
// Якщо об'єкт salaries порожній, то результат повинен бути 0

//const salaries = {
  //Mango: 100,
  //Poly: 160,
  //Ajax: 1470,
//}





// todo Напишіть функцію calcTotalPrice(stones, stonesName), яка приймає масив об'єктів та рядок із назвою каменя.
// Функція рахує і повертає загальну вартість каменів з таким іменем, ціною та кількістю з об'єкта

//const stonesArray = [
  //{ name: 'Изумруд', price: 1300, quantity: 4 },
  //{ name: 'Бриллиант', price: 2700, quantity: 6 },
  //{ name: 'Сапфир', price: 400, quantity: 7 },
  //{ name: 'Щебень', price: 150, quantity: 100 },
//]






// todo Створіть об'єкт calculator із трьома методами
// read(a, b) - приймає два аргументи і зберігає їх як властивості об'єкта
// sum() повертає суму збережених значень
// mult() помножує збережені значення і повертає результат

//const calculator = {
    //read(a, b) {
       // this.a = a;
        //this.b = b;
   // },

    //sum() {
       // return this.a + this.b;
    //},

    //mult() {
        //return this.a * this.b;
    //}
//}

//calculator.read(7, 5);
//console.log(calculator.sum());
//console.log(calculator.mult());







// todo Напишіть функцію updateObject, яка приймає об'єкт і повертає новий об'єкт без вказаних параметрів
// Результат, що очікується ({a: 1, b: 2, c: 3}, 'b', 'a') => {c: 3}

//function updateObject(obj1, ...arr) {
    //const newObj = {};
    //for (const key of Object.keys(obj1)) {
        //if (!arr.includes(key)) {
           // newObj[key] = obj1[key]
        //}
    //}
    //return newObj;
//}
//console.log(updateObject({ a: 1, b: 2, c: 3 }, 'b', 'a'))





//const arrNumber = [11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1]
// Напишіть функцію, яка розвертає масив у зворотньому напрямку.Метод reverse() не використовувати






// Напишіть функцію, яка очистить масив від небажаних значень, таких як false, undefined, порожні рядки, нуль, null
// Результат, що очікується[0, 1, false, 2, undefined, '', 3, null] => [1, 2, 3]

function filterRangeInPlace(arr) {

    for (let i = 0; i < arr.length; i++) {
        let val = arr[i];

        if (!val) {
            arr.splice(i, 1);
            i -= 1;
        } 
    }
    return arr;
}

const arr = [0, 1, false, 2, undefined, '', 3, null]
console.log(filterRangeInPlace(arr));
